---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.FailedToSetLeaderGroupId
source: html/df9afb64-3ed9-8723-d6b8-933914815891.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.FailedToSetLeaderGroupId Property

Unable to set id of group type.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToSetLeaderGroupId { get; }
```